In [13]:
import pandas as pd
data=[1,2,3,4,45,5,6,6,7]
df1=pd.Series(data,index=["jb","wnj","wjdj","hj","jgyg","jhygg","gy","jhgh","hjg"])
df1

jb        1
wnj       2
wjdj      3
hj        4
jgyg     45
jhygg     5
gy        6
jhgh      6
hjg       7
dtype: int64

In [14]:
import pandas as pd
data=[[1,2,3,4],[45,5,6,7],[8,9,10,11],[12,23,56,78],[51,62,79,20]]
df2=pd.DataFrame(data,columns=["jb","wnj","wjdj","hj",])
df2

   jb  wnj  wjdj  hj
0   1    2     3   4
1  45    5     6   7
2   8    9    10  11
3  12   23    56  78
4  51   62    79  20

In [15]:
df2[0:3]

   jb  wnj  wjdj  hj
0   1    2     3   4
1  45    5     6   7
2   8    9    10  11

In [16]:
df2.columns

Index(['jb', 'wnj', 'wjdj', 'hj'], dtype='object')

In [17]:
df2["jb"]

0     1
1    45
2     8
3    12
4    51
Name: jb, dtype: int64

In [18]:
d=[[1234,456],[345,567],[456,7456]]
r=pd.DataFrame(d)
r[0]

0    1234
1     345
2     456
Name: 0, dtype: int64

In [19]:
df2[["jb","wnj"]]

   jb  wnj
0   1    2
1  45    5
2   8    9
3  12   23
4  51   62

In [20]:
df2.describe()

              jb        wnj       wjdj         hj
count   5.000000   5.000000   5.000000   5.000000
mean   23.400000  20.200000  30.800000  24.000000
std    22.897598  24.712345  34.564433  30.781488
min     1.000000   2.000000   3.000000   4.000000
25%     8.000000   5.000000   6.000000   7.000000
50%    12.000000   9.000000  10.000000  11.000000
75%    45.000000  23.000000  56.000000  20.000000
max    51.000000  62.000000  79.000000  78.000000

In [21]:
df2.jb[0]

1

In [29]:
import pandas as pd
import numpy as np
data=[[1,2,3,np.nan],[45,5,np.nan,7],[8,np.nan,10,11],[np.nan,23,56,78],[51,62,np.nan,20]]
df3=pd.DataFrame(data,columns=["jb","wnj","wjdj","hj",])
df3

     jb   wnj  wjdj    hj
0   1.0   2.0   3.0   NaN
1  45.0   5.0   NaN   7.0
2   8.0   NaN  10.0  11.0
3   NaN  23.0  56.0  78.0
4  51.0  62.0   NaN  20.0

In [23]:
type(df3)

pandas.core.frame.DataFrame

In [24]:
df3.isna()

      jb    wnj   wjdj     hj
0  False  False  False   True
1  False  False   True  False
2  False   True  False  False
3   True  False  False  False
4  False  False   True  False

In [25]:
df3.fillna(0)

     jb   wnj  wjdj    hj
0   1.0   2.0   3.0   0.0
1  45.0   5.0   0.0   7.0
2   8.0   0.0  10.0  11.0
3   0.0  23.0  56.0  78.0
4  51.0  62.0   0.0  20.0

In [37]:
df3.fillna({'jb':0.0})

     jb   wnj  wjdj    hj
0   1.0   2.0   3.0   NaN
1  45.0   5.0   NaN   7.0
2   8.0   NaN  10.0  11.0
3   0.0  23.0  56.0  78.0
4  51.0  62.0   NaN  20.0

In [44]:
new_df=df3.replace(np.NaN,value=9999)
new_df

       jb     wnj    wjdj      hj
0     1.0     2.0     3.0  9999.0
1    45.0     5.0  9999.0     7.0
2     8.0  9999.0    10.0    11.0
3  9999.0    23.0    56.0    78.0
4    51.0    62.0  9999.0    20.0

In [50]:
new_df1=df3.replace(to_replace=[9999.0,8888],value=0,inplace=True)
new_df1

In [57]:
new_df2=df3.replace(to_replace=[0,8888],value=99999)
new_df2

        jb      wnj     wjdj       hj
0      1.0      2.0      3.0  99999.0
1     45.0      5.0  99999.0      7.0
2      8.0  99999.0     10.0     11.0
3  99999.0     23.0     56.0     78.0
4     51.0     62.0  99999.0     20.0

In [55]:
new=df3.replace({'jb':99999.0,'wnj':99999.0,'wjdj':99999.0,'hj':99999.0},value=np.nan)
new

     jb   wnj  wjdj    hj
0   1.0   2.0   3.0   NaN
1  45.0   5.0   NaN   7.0
2   8.0   NaN  10.0  11.0
3   NaN  23.0  56.0  78.0
4  51.0  62.0   NaN  20.0